Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The container attempts to remove all unused beans, interceptors and decorators during build by default. This optimization helps to minimize the amount of generated classes, thus conserving memory. However, Quarkus can't detect the programmatic lookup performed via the `CDI.current()` static method. Therefore, it is possible that a removal results in a false positive error, i.e. a bean is removed although it's actually used. In such cases, you'll notice a big warning in the log. Users and extension authors have several options xref:eliminate_false_positives[how to eliminate false positives].
ja_jp: コンテナは、デフォルトでビルド時に未使用の Bean、インターセプター、デコレーターをすべて削除しようとします。この最適化により、生成されるクラスの量を最小限に抑えることができるため、メモリを節約することができます。ただし、Quarkusでは、 `CDI.current()` の静的メソッドを介して実行されるプログラムによるルックアップを検出することはできません。つまり、実際には使用されているにもかかわらず、Beanが削除される可能性があります。このような場合、ログに大きな警告が表示されます。ユーザーやエクステンションの作者には、 xref:eliminate_false_positives[誤検出をなくす] ためのいくつかのオプションがあります。

source: The container attempts to xref:cdi-reference.adoc#remove_unused_beans[remove all unused beans] during the build by default. This optimization allows for _framework-level dead code elimination_. In few special cases, it's not possible to correctly identify an unused bean. In particular, Quarkus is not able to detect the usage of the `CDI.current()` static method yet. Extensions can eliminate possible false positives by producing an `UnremovableBeanBuildItem`.
ja_jp: コンテナは、デフォルトでビルド中に xref:cdi-reference.adoc#remove_unused_beans[すべての未使用Beanを削除] しようとします。この最適化によって， _フレームワークレベルのデッドコード除去が_ 可能になります。いくつかの特殊なケースでは、未使用のBeanを正しく識別することができません。特に、Quarkusでは、 `CDI.current()` 静的メソッドの使用をまだ検出できません。エクステンションは、 `UnremovableBeanBuildItem` を生成することで、誤検出の可能性を排除することができます。

source: The container image sizes were measured using our default images, which are based on Red Hat's UBI 9 Minimal and use JDK 25.
ja_jp: コンテナーイメージのサイズは、Red Hat の UBI 9 Minimal をベースとし、JDK 25 を使用する当社のデフォルトイメージを使用して測定されました。

source: The container is bootstrapped in multiple phases. From a high level perspective these phases go as follows:
ja_jp: コンテナーは複数のフェーズでブートストラップされます。高レベルの視点から見ると、これらのフェーズは以下のようになります。

source: The container running the resource to test against, for example PostgreSQL via Testcontainers, is assigned an IP address from the container's network. Use the container's "public" IP from its network and the "unmapped" port number to connect to the service. The Testcontainers library usually return connection strings without respecting the container network, so additional code is needed to provide Quarkus the "correct" connection string using the container's IP on the container network and the _unmapped_ port number.
ja_jp: テストするリソースを実行しているコンテナー (たとえば Testcontainers を介した PostgreSQL) には、コンテナーのネットワークから IP アドレスが割り当てられます。コンテナーのネットワークからの「パブリック」IP と「マップされていない」ポート番号を使用してサービスに接続します。Testcontainers ライブラリーは通常、コンテナーネットワークを尊重せずに接続文字列を返すため、コンテナーネットワーク上のコンテナーの IP と_マップされていない_ポート番号を使用して Quarkus に正しい接続文字列を提供するには、追加のコードが必要です。

source: The container will call this method when creating the bean instance.
ja_jp: コンテナーは、Beanのインスタンスを作成する際にこのメソッドを呼び出します。

source: The container will read this field when creating the bean instance.
ja_jp: コンテナーは、Beanのインスタンスを作成するときにこのフィールドを読みます。

source: The content negotiation is performed automatically. The resulting output depends on the `Accept` header received from the client.
ja_jp: コンテンツネゴシエーションは自動的に実行されます。結果の出力はクライアントから受け取った `Accept` ヘッダーに依存します。

source: The content of server-config-override.xml file
ja_jp: server-config-override.xml ファイルの内容

source: The content of the main block is used for an `{#insert}` section with no name parameter specified.
ja_jp: メインブロックのコンテンツは、name パラメーターが指定されていない `{#insert}` セクションに使用されます。

source: The content of the properties artifacts found earlier will dominate over those found later among the application's dependency constraints!
ja_jp: アプリケーションの依存性制約の中では、先に見つかったプロパティアーティファクトの内容が、後に見つかったものよりも優先されます。

source: The content of the section is always ignored.
ja_jp: セクションの内容は常に無視されます。

source: The content of this guide and been revised and split into additional topics. Please check the <<additional-information,Additional Information>> section.
ja_jp: 本ガイドの内容を改訂し、さらにトピックを分割しました。<<additional-information,追加情報>>をご覧ください。

source: The content of this guide and been revised and split into additional topics. Please check the xref:additional-information[Additional Information] section.
ja_jp: このガイドの内容は改訂され、追加のトピックに分割されています。 xref:additional-information[追加情報] の項目をご確認ください。

source: The content of this guide has been revised and split into additional topics. Please check the <<additional-information,Additional Information>> section.
ja_jp: 本ガイドの内容を改訂し、さらにトピックを分割しました。<<additional-information,追加情報>>をご覧ください。

source: The content of this guide has been revised and split into additional topics. Please check the xref:additional-information[Additional Information] section.
ja_jp: このガイドの内容は改訂され、追加トピックに分割されています。 xref:additional-information[追加情報] の項目をご確認ください。

source: The contents of the file specified by the given path
ja_jp: 指定されたパスで指定されたファイルの内容

source: The contents of this file will be included in your extension card, so for example we can place two links with some styling and icons:
ja_jp: このファイルの内容が、エクステンションカードに含まれますので、例えば、次のようにいくつかのスタイリングとアイコンと共に2つのリンクを配置することができます:

source: The context object allows you to get:
ja_jp: コンテキストオブジェクトによって、以下を取得することができます。

source: The context of the requests was not properly terminated and, for a given thread, all further requests would use the context of the first request the thread treated. The context includes authentication if your GraphQL services require authentication.
ja_jp: リクエストのコンテキストが適切に終了せず、与えられたスレッドに対して、それ以降のすべてのリクエストは、そのスレッドが処理した最初のリクエストのコンテキストを使用することになります。GraphQL サービスで認証が必要な場合、コンテキストには認証が含まれます。

source: The conversion from DTO to JSON is handled automatically for us, but we still must convert from `Fruit` to `FruitDto` and vice versa. This must be done manually, which is why we have two conversion methods declared in `FruitResource`: `convertToDto` and `convertFromDto`.
ja_jp: DTO から JSON への変換は自動的に処理されますが、それでも `Fruit` から `FruitDto` に、またはその逆に変換する必要があります。これは手動で行う必要があるので、 `FruitResource` で 2 つの変換メソッド `convertToDto` と `convertFromDto` を宣言しています。

source: The cookie domain
ja_jp: Cookie ドメイン

source: The cookie force secure
ja_jp: Cookie への secure 属性の強制

source: The cookie path
ja_jp: Cookie パス

source: The cookie path header
ja_jp: Cookie パスヘッダー

source: The cookie suffix
ja_jp: Cookie サフィックス

source: The coordinator is responsible for reliably creating and ending LRAs and for managing participant enlistment and it therefore must be available (for example if it or the network fail then something in the environment is responsible for restarting the coordinator or for repairing the network, respectively). To fulfill this task the coordinator must have access to durable storage for its logs (via a filesystem or in a database). At the time of writing, managing coordinators is the responsibility of the user. An "out-of-the-box" solution will be forthcoming.
ja_jp: コーディネーターは、LRAを確実に作成・終了し、参加者の参加を管理する役割を担っているため、利用可能でなければなりません（例えば、コーディネーターやネットワークに障害が発生した場合、環境の何かがコーディネーターの再起動やネットワークの修復を行う責任を持たなければなりません）。このタスクを遂行するために、コーディネーターはログを保存するための耐久性のあるストレージにアクセスできなければなりません（ファイルシステムまたはデータベースを介して）。本稿執筆時点では、コーディネーターの管理はユーザーの責任です。「すぐに使える」ソリューションが今後登場する予定です。

source: The coordinator is responsible for reliably creating and ending LRAs and for managing participant enlistment, and it therefore must be available (for example if it or the network fail then something in the environment is responsible for restarting the coordinator or for repairing the network, respectively). To fulfill this task the coordinator must have access to durable storage for its logs (via a filesystem or in a database). At the time of writing, managing coordinators is the responsibility of the user. An "out-of-the-box" solution will be forthcoming.
ja_jp: コーディネーターは、LRAを確実に作成・終了し、参加者の参加を管理する役割を担っているため、利用可能でなければなりません（例えば、コーディネーターやネットワークに障害が発生した場合、環境の何かがコーディネーターの再起動やネットワークの修復を行う責任を持たなければなりません）。このタスクを遂行するために、コーディネーターはログを保存するための耐久性のあるストレージにアクセスできなければなりません（ファイルシステムまたはデータベースを介して）。本稿執筆時点では、コーディネーターの管理はユーザーの責任です。「すぐに使える」ソリューションが今後登場する予定です。

source: The copied file contains this comment instead:
ja_jp: コピーされたファイルには、代わりにこのコメントが含まれています。

source: The core part of Quarkus 3.33 LTS is based on Quarkus 3.32 with some additional fixes included in 3.33.1.
ja_jp: Quarkus 3.33 LTSのコア部分はQuarkus 3.32をベースとしており、3.33.1に含まれるいくつかの追加修正が適用されています。

source: The correlation between application and bound services is expressed through the `ServiceBinding` resources, which declares the intent of what services are meant to be bound to what application.
ja_jp: アプリケーションとバインドされたサービスの相関は `ServiceBinding` リソースによって表現され、これにより、どのサービスがどのアプリケーションにバインドされるかという意図が宣言されます。

source: The corresponding GraphQL query looks like this:
ja_jp: これに対応するGraphQLクエリは次のようになります:

source: The corresponding `application.properties` will look like.
ja_jp: 対応する `application.properties` は次のようになります。

source: The corresponding `requiresIf` element is also supported.
ja_jp: 対応する `requiresIf` 要素もサポートされています。

source: The corresponding call would look like this:
ja_jp: 対応する呼び出しは次のようになります。

source: The corresponding converter will look similar to the one below.
ja_jp: 対応するコンバータは以下のようになります。

source: The corresponding deserializer class needs to be subclassed. So, let's create a `FruitDeserializer` that extends the `ObjectMapperDeserializer`.
ja_jp: 対応するデシリアライザークラスはサブクラス化する必要があります。そこで、 `ObjectMapperDeserializer` を拡張する `FruitDeserializer` を作成しましょう。

source: The corresponding deserializer class needs to be subclassed. So, let's create a `FruitDeserializer` that extends the generic `JsonbDeserializer`.
ja_jp: 対応するデシリアライザークラスはサブクラス化する必要があります。そこで、一般的な `JsonbDeserializer` を拡張する `FruitDeserializer` を作成しましょう。

source: The corresponding non-application endpoint is declared using `.routeConfigKey` to associate the route with a name:
ja_jp: 対応する非アプリケーションのエンドポイントは、 `.routeConfigKey` を使って宣言され、ルートと名前が関連付けられます。

source: The corresponding test could look like:
ja_jp: 対応するテストは次のようになります:

source: The cost of making up to 2 remote calls per every incoming bearer or code flow access token can sometimes be problematic.
ja_jp: 着信ベアラーまたはコードフローアクセストークンごとに最大 2 つのリモート呼び出しを行うコストが、問題になる場合があります。

source: The cost of making up to two remote calls for every incoming bearer or code flow access token can sometimes be problematic.
ja_jp: 場合によっては、着信ベアラーまたはコードフローアクセストークンごとに最大 2 つのリモート呼び出しを行うコストが問題になります。

source: The count, sum, and histogram data associated with timers and distribution summaries can be re-aggregated across dimensions (or across a series of instances).
ja_jp: タイマーとディストリビューションサマリーに関連付けられたカウント、合計、およびヒストグラムデータは、ディメンション全体 (または一連のインスタンス全体) にわたって再集計できます。

source: The credential provider can only be used with PKCS12 and JKS keystores.
ja_jp: 認証情報プロバイダーは、PKCS12 および JKS キーストアでのみ使用できます。

source: The credential provider can only be used with PKCS12 and JKS truststores.
ja_jp: 認証情報プロバイダーは、PKCS12 および JKS トラストストアでのみ使用できます。

source: The cron expression is evaluated in the context of the default time zone. However, it is also possible to associate the cron expression with a specific time zone.
ja_jp: cron式は、デフォルトのタイムゾーンのコンテキストで評価されます。しかし、cron式を特定のタイムゾーンに関連付けることも可能です。

source: The cross reference starts with `xref:`, uses a cross-reference source attribute(`\{doc-guides}`), and provides a readable description: `[Quarkus Documentation concepts]`.
ja_jp: 相互参照は `xref:` で始まり、相互参照ソース属性 (`\{doc-guides}`)、および読みやすい説明を提供します: `[Quarkus ドキュメントの概念]`

source: The cross-reference starts with `xref:`, and provides a readable description: `[Quarkus Documentation concepts]`.
ja_jp: クロスリファレンスは `xref:` で始まり、 `[Quarkus ドキュメントの概念]` など、読みやすい説明を提供します。

source: The cross-reference starts with `xref:`, uses a cross-reference source attribute(`\{doc-guides}`), and provides a readable description: `[Quarkus Documentation concepts]`.
ja_jp: 相互参照は `xref:` で始まり、相互参照ソース属性 (`\{doc-guides}`)、および読みやすい説明を提供します: `[Quarkus ドキュメントの概念]`

source: The current `SecurityIdentity` instance is still available and can be used during the `SecurityIdentity` update.
ja_jp: 現在の `SecurityIdentity` インスタンスは引き続き利用可能であり、`SecurityIdentity` の更新中に使用できます。

source: The current `ThreadContextClassLoader`
ja_jp: 現在の `ThreadContextClassLoader`

source: The current access token is used by default to test the service with Swagger UI or GrapghQL UI. If the provider (other than Keycloak) returns a binary access token, then it is used with Swagger UI or GrapghQL UI only if this provider has a token introspection endpoint; otherwise, an `IdToken`, which is always in a JWT format is passed to Swagger UI or GrapghQL UI. In such cases, you can verify with the manual Dev UI test that `401` is always returned for the current binary access token. Also, note that using `IdToken` as a fallback with either of these user interfaces is only possible with the authorization code flow.
ja_jp: 現在のアクセストークンは、Swagger UI または GrapghQL UI でサービスをテストするためにデフォルトで使用されます。 プロバイダー (Keycloak 以外) がバイナリーアクセストークンを返す場合、このプロバイダーにトークンイントロスペクションエンドポイントがある場合にのみ、Swagger UI または GrapghQL UI で使用されます。それ以外の場合は、常に JWT 形式の `IdToken` が Swagger UI または GrapghQL UI に渡されます。 このような場合、手動の Dev UI テストを使用して、現在のバイナリーアクセストークンに対して常に `401` が返されることを確認できます。 また、これらのいずれかのユーザーインターフェイスで `IdToken` をフォールバックとして使用することは、認可コードフローでのみ可能であることに注意してください。

source: The current access token is used by default to test the service with `Swagger UI` or `GrapghQL UI`. If the provider (other than Keycloak) returns a binary access token then it will be used with `Swagger UI` or `GrapghQL UI` only if this provider has a token introspection endpoint otherwise an `IdToken` which is always in a JWT format will be passed to `Swagger UI` or `GrapghQL UI`. In such cases you can verify with the manual Dev UI test that `401` will always be returned for the current binary access token. Also note that using `IdToken` as a fallback with either of these UIs is only possible with the authorization code flow.
ja_jp: デフォルトでは、現在のアクセストークンを使用して、 `Swagger UI` または `GrapghQL UI` でサービスをテストします。プロバイダー (Keycloak 以外) がバイナリーアクセストークンを返す場合、このプロバイダーにトークンイントロスペクションエンドポイントがある場合にのみ `Swagger UI` または `GrapghQL UI` で使用されます。それ以外の場合は、常に JWT 形式の `IdToken` が `Swagger UI` または `GrapghQL UI` に渡されます。このような場合、手動の Dev UI テストで、現在のバイナリーアクセストークンに対して常に `401` が返されることを確認できます。また、これらの UI のいずれかでフォールバックとして `Id Token` を使用することは、認可コードフローでのみ可能であることに注意してください。

source: The current context can be accessed via the implicit binding `this`.
ja_jp: 現在のコンテキストは、暗黙のバインディング `this` を通してアクセスできます。

source: The current context object inside the section is the map of resolved parameters.
ja_jp: セクション内の現在のコンテキストオブジェクトは、解決されたパラメーターのマップです。

source: The current default packaging in Quarkus is called `fast-jar`. One of its primary goals is to optimize class loading.
ja_jp: Quarkus の現在のデフォルトパッケージングは `fast-jar` と呼ばれています。その主要な目標の 1 つは、クラスローディングを最適化することです。

source: The current implementation of the `quarkus-azure-functions-http` extension no longer requires the `azure-functions-maven-plugin` or Gradle equivalent. Local development and Azure Functions packaging and deployment is now all done by Quarkus.
ja_jp: `quarkus-azure-functions-http` エクステンションの現在の実装では、`azure-functions-maven-plugin` や Gradle の同等のプラグインが不要になりました。ローカル開発や Azure Functions のパッケージングおよびデプロイメントは、すべて Quarkus によって行われます。

source: The current implementation of the `quarkus-azure-functions-http` extension no longer requires the `azure-functions-maven-plugin` or gradle equivalent. Local development and Azure Functions packaging and deployment is now all done by Quarkus.
ja_jp: `quarkus-azure-functions-http` エクステンションの現在の実装では、`azure-functions-maven-plugin` や Gradle の同等の プラグインが不要になりました。ローカル開発や Azure Functions のパッケージングおよびデプロイメントは、 すべて Quarkus によって行われます。

source: The current implementation of the `quarkus-azure-functions` extension no longer requires the `azure-functions-maven-plugin` or Gradle equivalent. Local development and Azure Functions packaging and deployment is now all done by Quarkus.
ja_jp: `quarkus-azure-functions` エクステンションの現在の実装では、`azure-functions-maven-plugin` または Gradle の同等のものが不要になりました。ローカル開発と Azure Functions のパッケージングおよびデプロイは、すべて Quarkus によって行われます。

source: The current implementation of the `quarkus-azure-functions` extension no longer requires the `azure-functions-maven-plugin` or gradle equivalent. Local development and Azure Functions packaging and deployment is now all done by Quarkus.
ja_jp: `quarkus-azure-functions` エクステンションの現在の実装では、もはや `azure-functions-maven-plugin` や Gradle の同等の プラグインは必要ありません。ローカル開発や Azure Functions のパッケージングおよびデプロイメントは、 すべて Quarkus によって行われます。

source: The current integration of Stork supports:
ja_jp: 現在のStork統合で対応しているのは次の通りです:

source: The current schema is simple with only two concrete types, `Hero` and `Film`. Now we want to expand our API with additional types and add some abstractions that make interacting with them easy for clients.
ja_jp: 現在のスキーマは， `Hero` と `Film` という2つの具象型だけのシンプルなものです。ここで、型を追加して拡張し、クライアントが簡単に型と対話できるような抽象化機能を追加してAPIを拡張したいと思います。

source: The current tenant's discovered link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect Configuration Metadata] is represented by `io.quarkus.oidc.OidcConfigurationMetadata` and can be either injected or accessed as a `SecurityIdentity` `configuration-metadata` attribute.
ja_jp: 現在のテナントが検出した link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect 設定メタデータ] は `io.quarkus.oidc.OidcConfigurationMetadata` で表され、 `SecurityIdentity` `configuration-metadata` 属性として注入またはアクセスが可能です。

source: The current tenant's discovered link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect Configuration Metadata] is represented by `io.quarkus.oidc.OidcConfigurationMetadata` and can be injected or accessed as a `SecurityIdentity` `configuration-metadata` attribute.
ja_jp: 現在のテナントの検出された link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect 設定メタデータ] は、 `io.quarkus.oidc.OidcConfigurationMetadata` で表され、 `SecurityIdentity` `configuration-metadata` 属性として注入またはアクセスできます。

source: The current tenant's discovered link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect configuration metadata] is represented by `io.quarkus.oidc.OidcConfigurationMetadata` and can be injected or accessed as a `SecurityIdentity` `configuration-metadata` attribute.
ja_jp: 現在のテナントの検出された link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect 設定メタデータ] は、 `io.quarkus.oidc.OidcConfigurationMetadata` で表され、 `SecurityIdentity` `configuration-metadata` 属性として注入またはアクセスできます。

source: The current user is displayed on the left, and you can use the top menu to try accessing the public API, which should work, while the user and admin APIs will fail and redirect you to the current page.
ja_jp: 左側に現在のユーザーが表示され、上部メニューで公開APIにアクセスしてみると、うまくいくはずですが、ユーザーAPIとadmin APIは失敗して現在のページにリダイレクトされます。

source: The current user session can be automatically extended by enabling the `quarkus.oidc.token.refresh-expired` property. If set to `true`, when the current ID token expires, a refresh token grant will be used to refresh the ID token and the access and refresh tokens.
ja_jp: `quarkus.oidc.token.refresh-expired` プロパティーを有効にすると、現在のユーザーセッションを自動的に延長できます。 `true` に設定すると、現在の ID トークンの有効期限が切れたときに、リフレッシュトークンの付与を使用して、ID トークン、アクセストークン、およびリフレッシュトークンがリフレッシュされます。

source: The current user session can be automatically extended by enabling the `quarkus.oidc.token.refresh-expired` property. If set to `true`, when the current ID token expires, a refresh token grant will be used to refresh the ID token as well as access and refresh tokens.
ja_jp: `quarkus.oidc.token.refresh-expired` プロパティーを有効にすると、現在のユーザーセッションを自動的に延長できます。 `true` に設定すると、現在の ID トークンの有効期限が切れたときに、リフレッシュトークンの付与を使用して、ID トークンだけでなくアクセストークンとリフレッシュトークンもリフレッシュされます。

source: The current user session may be automatically extended by enabling a `quarkus.oidc.token.refresh-expired` property. If it is set to `true` then when the current ID Token expires a Refresh Token Grant will be used to refresh ID Token as well as Access and Refresh Tokens.
ja_jp: 現在のユーザーセッションは、 `quarkus.oidc.token.refresh-expired` プロパティーを有効にすることで自動的に拡張される場合があります。 `true` に設定されている場合、現在の ID トークンの有効期限が切れると、リフレッシュ・トークンの付与が使用され、ID トークンだけでなく、アクセス・トークンやリフレッシュ・トークンもリフレッシュされます。

source: The current version of the project.
ja_jp: プロジェクトの現在のバージョン。

source: The custom configuration type converts the configuration value automatically:
ja_jp: カスタムコンフィグレーションタイプは、設定値を自動的に変換します。

source: The custom converter class must be `public`, must have a `public` constructor with no arguments, and must not be `abstract`.
ja_jp: カスタム・コンバータ・クラスは `public` でなければならず、 `public` コンストラクタは引数なしでなければならず、 `abstract` であってはなりません。

source: The custom key resolver, such as `AWS Application Load Balancer` (`ALB`) key resolver, resolves the keys against the AWS ALB key endpoint by using the current token's key identifier header value.
ja_jp: AWS Application Load Balancer (ALB) キーリゾルバーなどのカスタムキーリゾルバーは、現在のトークンのキー識別子ヘッダー値を使用して、AWS ALB キーエンドポイントに対してキーを解決します。

source: The custom provider is a factory that creates an `io.smallrye.stork.ServiceDiscovery` instance for each configured service using this service discovery provider. A type, for example, `acme` identifies each provider. This type is used in the configuration to reference the provider:
ja_jp: カスタムプロバイダーは、このサービスディスカバリープロバイダーを使用して設定されたサービスごとに `io.smallrye.stork.ServiceDiscovery` インスタンスを作成するファクトリーです。例えば `acme` のようなタイプが各プロバイダを識別します。このタイプは、設定でプロバイダーを参照するために使用されます。

source: The dashboards
ja_jp: ダッシュボード

source: The data above shows that there are ~100000 methods, and just over ~300000 edges between them.
ja_jp: 上のデータを見ると、約100,000のメソッドがあり、それらの間には約300,000のエッジがあることがわかります。

source: The data above shows that there are ~60000 methods, and just over ~200000 edges between them. The Quarkus application demonstrated here is very basic, so there’s not a lot we can explore, but here are some example queries you can run to explore the graph in more detail. Typically, you’d start by looking for a given method:
ja_jp: 上のデータでは、~60000のメソッドがあり、それらの間には~200000のエッジがあることがわかります。ここでデモされているQuarkusアプリケーションは非常に基本的なものなので、調べられることは多くありませんが、グラフをより詳細に調べるために実行できるクエリの例をいくつか紹介します。典型的な例としては、あるメソッドを探すことから始めます。

source: The data can be examined by inspecting the output topic. By exposing a Kafka Streams https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html[interactive query], the latest result for each weather station can alternatively be obtained via a simple REST query.
ja_jp: 出力トピックを検査することで、データを調べることができます。Kafka Streams の link:https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html[対話型クエリ] を公開することで、各気象観測所の最新の結果を単純な REST クエリで取得することができます。

source: The data is loaded when the application starts. By default, it drops the whole database before importing. You can prevent this using `quarkus.redis.flush-before-load=false`.
ja_jp: アプリケーションの起動時にデータを読み込みます。デフォルトでは、インポートする前にデータベース全体をドロップします。これを防ぐには、 `quarkus.redis.flush-before-load=false` を使用します。

source: The data is maintained by another node, so reply with a redirect (HTTP status code 303) if the data for the given key is stored on one of the other nodes.
ja_jp: 指定されたキーのデータが他のノードで管理されている場合は、リダイレクト（HTTPステータスコード303）で応答してください。

source: The data source APIs handle the serialization and deserialization automatically. By default, non-standard types are serialized into JSON and deserialized from JSON. In this case, `quarkus-jackson` is used.
ja_jp: データ・ソースAPIは、シリアライズとデシリアライズを自動的に処理します。 デフォルトでは、非標準型はJSONにシリアライズされ、JSONからデシリアライズされます。 この場合、 `quarkus-jackson` が使用されます。
